{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PUFPaY9KxDAcGqfsorJp3Q", "review_id": "Ya85v4eqdd6k9Od8HbQjyA", "stars": 4, "date": "2012-08-01", "text": "Mr Hoagie is an institution. Walking in, it does seem like a throwback to 30 years ago, old fashioned menu board, booths out of the 70s, and a large selection of food. Their speciality is the Italian Hoagie, and it is voted the best in the area year after year. I usually order the burger, while the patties are obviously cooked from frozen, all of the other ingredients are very fresh. Overall, its a good alternative to Subway, which is down the road.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Iu6AxdBYGR4A0wspR9BYHA", "review_id": "KPvLNJ21_4wbYNctrOwWdQ", "stars": 5, "date": "2014-02-13", "text": "Excellent food. Superb customer service. I miss the mario machines they used to have, but it's still a great place steeped in tradition.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "auESFwWvW42h6alXgFxAXQ", "review_id": "fFSoGV46Yxuwbr3fHNuZig", "stars": 5, "date": "2015-10-31", "text": "Yes this place is a little out dated and not opened on the weekend. But other than that the staff is always pleasant and fast to make your order. Which is always spot on fresh veggies on their hoggies and other food. They also have daily specials and ice cream which is really good. I had a banana split they piled the toppings on. They win pennysaver awards ever years i see why.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qiczib2fO_1VBG8IoCGvVg", "review_id": "pVMIt0a_QsKtuDfWVfSk2A", "stars": 3, "date": "2015-12-26", "text": "PROS: Italian hoagie was delicious.  Friendly counter employee. The restaurant was clean and neat. \n\nCONS: The pizza was not good.  Pre-formed crust, NOT fresh dough.  The price of the failure of a pizza WAS NOT CHEAP EITHER.  \n\nI guess the name says it all.  Get the hoagie, pass on the pizza.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qEE5EvV-f-s7yHC0Z4ydJQ", "review_id": "AEyiQ_Y44isJmNbMTyoMKQ", "stars": 2, "date": "2016-04-08", "text": "First the only reason this place could possibly win best hoagie is because there's no competition. Two hoagies and a side of onion rings cost $25.74\n\nSo I'm thinking with the reader choice awards and $10 per 12\" hoagie these will be awesome. \n\nI was sadly mistaken. \n\nThe only reason I didn't give one star is because is the bread & dressing is fairly decent. \n\nSo on to the hoagies, the Italian is general run of the mill. Minimal meat and a ton of shredded lettuce. You get more meat at subway. Nothing really special & NOT worthy of the $10 price tag. \n\nSecond, the steak hoagie, it is atrocious. \nNo cheese?!?!? You have to add cheese for $1 so now the steak hoagie is $11. That has so little amounts of meat that I thought I was eating a lettuce & onion hoagie. I am thoroughly disappointed with this hoagie, possibly the worst value of a hoagie I've ever eaten. \nI'm not say eating at subway is any better, but for the huge price difference you are better off doing so. \nCheck out pasquales down the road, better hoagie & price.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jBoH6qKGO7wdYyg_YjBcQA", "review_id": "V-bqYx62zpxfH2oFkzXPzw", "stars": 1, "date": "2016-04-10", "text": "Normally, I do not do reviews of an establishment unless the rating is exceptionally great or exceptionally bad.  If I had not felt sucker punched and mugged after I left Mr. Hoagie, I would not be writing this bad review.  On my first and last trip there, I paid $24.59 for two whole hoagies.  \n\n1) The Italian (ordered because the woman (she) working there told me it was their most popular hoagie) I ordered with lettuce and onions (no tomato, italian dressing which all come free with the hoagie).  I had to pay $1 to add cheese to the hoagie.  Because I was traveling and would not be eating the hoagie right away, I asked for the italian on the side.  She told me there was a charge for the dressing on the side.  I passed on that on principle.  Are you kidding me?  I just saved her money by declining the tomato.  I was not going to pay for the dressing on the side.  At this point, I am certain something is not right and this place appears to me to be in financial trouble.  That pales in comparison to what happened next.  I opened the hoagie and there were three microscopically thin slices of meat on this hoagie.  Ham, salami, and bologna.  Bologna!?!?!?!?    Who in the hell puts disgusting bologna on an Italian hoagie?  That disqualifies that hoagie as an Italian.  The red flags indicating this place is in financial trouble are blinding my view.  One area of this hoagie only had one slice of bologna, no ham and no salami.\n\n2)  The Steak hoagie came with nothing on it but lettuce, tomato, onions, and dressing.  I ordered it without lettuce, tomato, onions, or dressing.  I asked for mayo on the side.  I had to pay for that so I declined.  Are you kidding me?  I just saved them money by passing on the lettuce, tomato, fresh onions, and dressing!  I paid $3 to add sautéed mushrooms, onions, and cheese.  Here we go again.  Canned mushrooms that were not even cooked through (were still cold) and onions that were still crunchy/undercooked.  News flash:  you need to serve fresh mushrooms that have been sautéed (canned mushrooms are another sign this place is in financial trouble).  I literally had to open the hoagie to find the steak because I could not taste or see it.  The hoagie was 50% mushrooms, 30%onions, 10% cheese and 10% steak.\n\nI could have personally made 10 whole hoagies with substantial quality ingredients and toppings for the $24.59 I paid for these two whole hoagies.  I intentionally patronize non-chain restaurants to support small businesses.  In this case, Never. Again.  (The hoagie bun was better than average.)  Wake up or you are going to lose your business.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bWrodc7hN_T4q2r-rolrOA", "review_id": "3saY_LVFUpkAfd9t86VNdw", "stars": 4, "date": "2016-05-11", "text": "I like this place a lot. It's a good toasted hoagie.\n\nI actually don't like a my bun exploding with meat, but as a previous poster mentioned if you do maybe you wouldn't like this place.\n\nThe inside badly needs updated though. \n\nThe staff is friendly.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uK8tzraOp4M5u3uYrqIBXg", "review_id": "Di3exaUCFNw1V4kSNW5pgA", "stars": 5, "date": "2013-11-08", "text": "All the food is great here. But the best thing they have is their wings. Their wings are simply fantastic!!  The \"Wet Cajun\" are by the best & most popular.  I also like the seasoned salt wings.  Wing Night is Monday & Wednesday night, $0.75 whole wings!\n\nThe dining area is nice. Very family friendly! The bar is very nice is well.  This place is truly a Yinzer's dream!!  \"Pittsburgh Dad\" would love this place n'at!!", "type": "review", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I_47G-R2_egp7ME5u_ltew", "review_id": "0Lua2-PbqEQMjD9r89-asw", "stars": 3, "date": "2014-03-29", "text": "We checked this place out this past Monday for their wing night. We have heard that their wings are great and decided it was finally time to check it out. Their wings are whole wings and crispy, which is a nice change of pace. I got their wet Cajun sauce and garlic butter wings. The Cajun did not have a bold enough flavor for me and their sauce is too thin. The sauce was also thin for the garlic butter, but that is more expected. They were better than average, but I don't like seeing all the sauce resting at the bottom of the boat. I would definitely come try this place out again to sample some of the other items on the menu, but this will probably not become a regular stop for wings anytime soon.", "type": "review", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PP_xoMSYlGr2pb67BbqBdA", "review_id": "7N9j5YbBHBW6qguE5DAeyA", "stars": 1, "date": "2014-10-29", "text": "Wing sauce is like water. Pretty much a lot of butter and some hot sauce (franks red hot maybe).  The whole wings are good size and crispy, but for $1 a wing the sauce could be better. The hot and extra hot are about the same flavor/heat.  The fish sandwich is good and is a large portion, sides are decent.", "type": "review", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
